[
  {
    "id": 1,
    "title": "Frontend Developer",
    "company": "Dattabot",
    "period": "Jan 2022 - Present",
    "description": "Leading frontend development for enterprise applications using React and TypeScript. Mentoring junior developers and establishing best practices.",
    "technologies": [
      "React",
      "TypeScript",
      "Next.js",
      "Tailwind CSS"
    ],
    "responsibility": [
      "Developed and maintained production web applications in blockchain and supply chain domains.",
      "Implemented interactive, data-driven dashboards based on UI/UX specifications.",
      "Collaborated with blockchain engineers to build and maintain decentralized web applications (dApps).",
      "Integrated Web3 functionalities, including wallet connectivity and smart contract interactions.",
      "Built reusable and scalable React components following clean code and maintainability principles.",
      "Ensured cross-browser compatibility, responsive behavior, and basic accessibility compliance.",
      "Implemented unit tests to improve application stability and reliability."
    ],
    "companyLogo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTl9lNp8EmlvP7Tmp4q9IWa8ZxGe6DZ9WYiJQ&s",
    "type": "Full-time"
  },
  {
    "id": 2,
    "title": "Frontend Developer",
    "company": "Digital Aman Sentosa Indonesia",
    "period": "Mar 2024 - Oct 2024",
    "description": "Developed responsive web applications and collaborated with design teams to create seamless user experiences.",
    "technologies": [
      "React",
      "JavaScript",
      "CSS",
      "Git"
    ],
    "responsibility": [
      "Contributed to a government HR information system supporting civil servant management processes.",
      "Implemented application features based on service and regulatory requirements.",
      "Integrated frontend modules with backend APIs and internal services.",
      "Supported system stability through bug fixing, feature enhancements, and maintenance."
    ],
    "companyLogo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS4KrJ6GMwnjw124ypivjgDi1AkvLAmw9ERSg&s",
    "type": "Freelance"
  },
  {
    "id": 3,
    "title": "Frontend Developer",
    "company": "Badan Kepegawaian Negara Republik Indonesia",
    "period": "Oct 2022 - Dec 2022",
    "description": "Built and maintained web applications, participated in code reviews, and contributed to the company's design system.",
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "React"
    ],
    "responsibility": [
      "Develop Web App System called Sistem Informasi Aparatur Sipil Negara (SIASN).",
      "Develop a feature based on requirements.",
      "Handle features in promotion service, mutation service, and refreshment service.",
      "Integration with backend via API.",
      "Bug fixing."
    ],
    "companyLogo": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Logo_Badan_Kepegawaian_Negara.png",
    "type": "Freelance"
  }
]